# Antidote plugin list
# https://antidote.sh/
#
# Syntax: user/repo [options]
# Options:
#   path:subdir     - Load from subdirectory
#   kind:path       - Add to PATH instead of sourcing
#   kind:fpath      - Add to fpath for completions
#   kind:defer      - Defer loading (requires romkatv/zsh-defer)

# Deferred loading support - MUST BE FIRST
romkatv/zsh-defer

# Theme (load first for instant prompt)
romkatv/powerlevel10k

# Vi-mode - load immediately for instant keybindings
ohmyzsh/ohmyzsh path:plugins/vi-mode

# Completion paths - load immediately (just adds to fpath, fast)
zsh-users/zsh-completions kind:fpath
ohmyzsh/ohmyzsh path:plugins/httpie kind:fpath
ohmyzsh/ohmyzsh path:plugins/ripgrep kind:fpath
ohmyzsh/ohmyzsh path:plugins/fd kind:fpath

# Core enhancements - DEFERRED
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-history-substring-search kind:defer

# Directory navigation - DEFERRED
changyuheng/zsh-interactive-cd kind:defer

# Git tools - DEFERRED
wfxr/forgit kind:defer
bigH/git-fuzzy path:bin kind:path

# oh-my-zsh plugins - DEFERRED
ohmyzsh/ohmyzsh path:plugins/aws kind:defer
ohmyzsh/ohmyzsh path:plugins/cp kind:defer
ohmyzsh/ohmyzsh path:plugins/docker kind:defer
ohmyzsh/ohmyzsh path:plugins/git kind:defer
ohmyzsh/ohmyzsh path:plugins/git-extras kind:defer
ohmyzsh/ohmyzsh path:plugins/gh kind:defer
ohmyzsh/ohmyzsh path:plugins/macos kind:defer
ohmyzsh/ohmyzsh path:plugins/uv kind:defer

# vim: set ft=zsh:
