# Antidote plugin list
# https://antidote.sh/
#
# Syntax: user/repo [options]
# Options:
#   path:subdir     - Load from subdirectory
#   kind:path       - Add to PATH instead of sourcing
#   kind:fpath      - Add to fpath for completions
#   kind:defer      - Defer loading (requires romkatv/zsh-defer)

# Theme (load first for instant prompt)
romkatv/powerlevel10k

# Core enhancements
zsh-users/zsh-autosuggestions
zsh-users/zsh-completions kind:fpath
zsh-users/zsh-history-substring-search

# Directory navigation
changyuheng/zsh-interactive-cd

# Git tools
wfxr/forgit
bigH/git-fuzzy path:bin kind:path

# oh-my-zsh plugins (loaded directly, no framework needed)
ohmyzsh/ohmyzsh path:plugins/vi-mode
ohmyzsh/ohmyzsh path:plugins/aws
ohmyzsh/ohmyzsh path:plugins/cp
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/httpie kind:fpath
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/git-extras
ohmyzsh/ohmyzsh path:plugins/github
ohmyzsh/ohmyzsh path:plugins/macos
ohmyzsh/ohmyzsh path:plugins/uv

# vim: set ft=zsh:
