ack
awk
awscli
bash-completion
bat
coreutils
ctags
curl
diff-so-fancy
direnv
dnsmasq
dos2unix
emojify
fd
findutils
fontforge
gifsicle
git
git-crypt
git-extras
git-lfs
gnu-sed
gnu-tar
go
grep
heroku/brew/heroku
highlight
htop
httpie
hub
iftop
imagemagick
ispell
jq
knot
lbzip2
less
m-cli
mas
mkcert
moreutils
ncdu
neovim
nmap
nss
optipng
oxipng
p7zip
parallel
knqyf263/pet/pet
pgcli
pigz
plzip
pngquant
prettyping
pv
pyenv-ccache
pyenv-pip-migrate
pyenv-virtualenv
rename
ripgrep
rsync
shellcheck
sphinx-doc
ssh-copy-id
syncthing
syncthing-inotify
tealdeer
telnet
tmux
trash
tree
unrar
watchman
wget
wireguard-tools
yarn
yasm
youtube-dl
zlib
zplug
zsh
