1password-beta
adoptopenjdk
alfred
authy
backblaze
bartender
calibre
cryptomator
dbeaver-community
deluge
docker-edge
dropbox-beta
firefox-beta
flycut
google-chrome-beta
gpg-suite
hammerspoon
iina-beta
imageoptim
iterm2-beta
keka
keybase
kindle-previewer
little-snitch
logitech-options
microsoft-office
numi
pgadmin4
qlimagesize
qlmarkdown-gfm
qlmobi
qlstephen
qlvideo
quicklook-csv
quicklook-json
rsyncosx
signal
slack-beta
sourcetree-beta
spotify
visual-studio-code
zoomus
mullvadvpn
